In [2]:
import pandas as pd

In [3]:
#df = pd.read_csv("https://transtats.bts.gov/ftproot/TranStatsData/674203356_T_ONTIME_REPORTING.zip")
# un comment the above line of code to get data from web

df = pd.read_csv("674203356_T_ONTIME_REPORTING.csv")
df.head()

,YEAR,MONTH,DAY_OF_MONTH,FL_DATE,OP_UNIQUE_CARRIER,OP_CARRIER_AIRLINE_ID,TAIL_NUM,OP_CARRIER_FL_NUM,ORIGIN_AIRPORT_ID,ORIGIN_AIRPORT_SEQ_ID,...,DIVERTED,AIR_TIME,FLIGHTS,DISTANCE,CARRIER_DELAY,WEATHER_DELAY,NAS_DELAY,SECURITY_DELAY,LATE_AIRCRAFT_DELAY,Unnamed: 35
0,2019,12,8,2019-12-08,WN,19393,N8651A,3689,15016,1501606,...,0.0,253.0,1.0,1557.0,0.0,0.0,18.0,0.0,0.0,NaN
1,2019,12,8,2019-12-08,WN,19393,N939WN,2600,15016,1501606,...,0.0,110.0,1.0,786.0,NaN,NaN,NaN,NaN,NaN,NaN
2,2019,12,8,2019-12-08,WN,19393,N7741C,2770,15016,1501606,...,0.0,120.0,1.0,786.0,NaN,NaN,NaN,NaN,NaN,NaN
3,2019,12,8,2019-12-08,WN,19393,N550WN,6654,15016,1501606,...,0.0,239.0,1.0,1709.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2019,12,8,2019-12-08,WN,19393,N8319F,3402,15016,1501606,...,0.0,242.0,1.0,1735.0,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
df.columns

Index(['YEAR', 'MONTH', 'DAY_OF_MONTH', 'FL_DATE', 'OP_UNIQUE_CARRIER',
       'OP_CARRIER_AIRLINE_ID', 'TAIL_NUM', 'OP_CARRIER_FL_NUM',
       'ORIGIN_AIRPORT_ID', 'ORIGIN_AIRPORT_SEQ_ID', 'ORIGIN_CITY_MARKET_ID',
       'ORIGIN', 'ORIGIN_CITY_NAME', 'ORIGIN_STATE_ABR', 'ORIGIN_STATE_NM',
       'DEST_AIRPORT_ID', 'DEST_AIRPORT_SEQ_ID', 'DEST_CITY_MARKET_ID', 'DEST',
       'DEST_CITY_NAME', 'DEST_STATE_ABR', 'DEST_STATE_NM', 'DEP_DELAY',
       'TAXI_OUT', 'ARR_DELAY', 'CANCELLED', 'DIVERTED', 'AIR_TIME', 'FLIGHTS',
       'DISTANCE', 'CARRIER_DELAY', 'WEATHER_DELAY', 'NAS_DELAY',
       'SECURITY_DELAY', 'LATE_AIRCRAFT_DELAY', 'Unnamed: 35'],
      dtype='object')

# Q1

In [6]:
df['OP_CARRIER_AIRLINE_ID'].value_counts()[:3]

19393    114442
19790     81524
19805     79405
Name: OP_CARRIER_AIRLINE_ID, dtype: int64

# Q2

In [7]:
df["FLIGHTS"].sum()

625763.0

# Q3

In [11]:
df['AIR_TIME'].sum()/60

1168534.9333333333

# Q4

In [16]:
#df[['ORIGIN_CITY_NAME', 'DEST_CITY_NAME']].head()
df['DEST_CITY_NAME'].append(df['ORIGIN_CITY_NAME']).value_counts()

Chicago, IL              68556
Atlanta, GA              64610
Dallas/Fort Worth, TX    51021
New York, NY             48313
Denver, CO               42665
                         ...
Owensboro, KY               18
Ogden, UT                   18
Adak Island, AK             16
Greenville, NC               4
Cody, WY                     3
Length: 343, dtype: int64

# Q5

In [24]:
df1 = df[['OP_CARRIER_AIRLINE_ID', 'DISTANCE']]
df1.head()

   OP_CARRIER_AIRLINE_ID  DISTANCE
0                  19393    1557.0
1                  19393     786.0
2                  19393     786.0
3                  19393    1709.0
4                  19393    1735.0

In [40]:
data = df1.groupby('OP_CARRIER_AIRLINE_ID')['DISTANCE'].sum().reset_index()
data.loc[data.DISTANCE==data['DISTANCE'].max()]

   OP_CARRIER_AIRLINE_ID    DISTANCE
0                  19393  86807867.0

In [41]:
data2 = pd.read_csv('L_AIRLINE_ID.csv')
data2.head()

    Code                      Description
0  19031   Mackey International Inc.: MAC
1  19032  Munz Northern Airlines Inc.: XY
2  19033       Cochise Airlines Inc.: COC
3  19034   Golden Gate Airlines Inc.: GSA
4  19035               Aeromech Inc.: RZZ

In [44]:
data2.loc[data2['Code']==19393]

      Code                 Description
362  19393  Southwest Airlines Co.: WN

In [46]:
'Southwest Airlines Co.: WN'.upper()

'SOUTHWEST AIRLINES CO.: WN'

# Q6

In [55]:
df.groupby('TAIL_NUM')['DISTANCE'].sum().sort_values(ascending=False)

TAIL_NUM
N944JT    202536.0
N990JL    196942.0
N980JT    193317.0
N923JB    193083.0
N983JT    192809.0
            ...
N864DA       907.0
N853NW       907.0
N852NW       760.0
N782UA       674.0
N39726       258.0
Name: DISTANCE, Length: 5478, dtype: float64

# Q7

In [56]:
df[['ARR_DELAY', 'DEP_DELAY', 'ORIGIN_STATE_NM', 'DEST_STATE_NM']]

        ARR_DELAY  DEP_DELAY ORIGIN_STATE_NM  DEST_STATE_NM
0            18.0       -3.0        Missouri     California
1           -12.0        8.0        Missouri          Texas
2           -14.0       -5.0        Missouri          Texas
3           -24.0       -5.0        Missouri     Washington
4             3.0       17.0        Missouri     California
...           ...        ...             ...            ...
625758       52.0       64.0         Florida       New York
625759      -17.0       -6.0        Virginia  Massachusetts
625760      -34.0       -8.0    Pennsylvania  Massachusetts
625761      -27.0       -1.0   Massachusetts    Puerto Rico
625762      -16.0        2.0     Puerto Rico  Massachusetts

[625763 rows x 4 columns]

# Q8

In [69]:
df8 = df[['ORIGIN_STATE_NM', 'TAXI_OUT', 'DAY_OF_MONTH']]

In [70]:
df8.loc[df8['ORIGIN_STATE_NM']=='New York', 'TAXI_OUT'].isna().sum()

417

In [76]:
df8.loc[df8['ORIGIN_STATE_NM']=='New York', ['TAXI_OUT', 'DAY_OF_MONTH']].head()

     TAXI_OUT  DAY_OF_MONTH
150       8.0             9
151       9.0             9
152       8.0             9
153      10.0             9
154      10.0             9

In [72]:
df8['DAY_OF_MONTH'].nunique()

31

In [75]:
df8.loc[df8['ORIGIN_STATE_NM']=='New York', 'TAXI_OUT'].sum()/31

24363.129032258064

# Q9

In [80]:
df9 = df[['DEST_STATE_NM', 'DIVERTED']]
df9.head()

  DEST_STATE_NM  DIVERTED
0    California       0.0
1         Texas       0.0
2         Texas       0.0
3    Washington       0.0
4    California       0.0

In [86]:
df9.loc[df9['DEST_STATE_NM']=='New York']['DIVERTED'].value_counts()

0.0    31621
1.0      108
Name: DIVERTED, dtype: int64

# Q10

In [90]:
df[['CARRIER_DELAY', 'WEATHER_DELAY', 'NAS_DELAY', 'SECURITY_DELAY', 'LATE_AIRCRAFT_DELAY']].head()

,CARRIER_DELAY,WEATHER_DELAY,NAS_DELAY,SECURITY_DELAY,LATE_AIRCRAFT_DELAY
0,0.0,0.0,18.0,0.0,0.0
1,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN

# Q11

In [232]:
df11 = df[['DAY_OF_MONTH', 'ORIGIN_STATE_NM', 'DEST_STATE_NM']]
df11.head()

   DAY_OF_MONTH ORIGIN_STATE_NM DEST_STATE_NM
0             8        Missouri    California
1             8        Missouri         Texas
2             8        Missouri         Texas
3             8        Missouri    Washington
4             8        Missouri    California

In [233]:
df11 = df11[(df11['DAY_OF_MONTH']==25) | (df11['DAY_OF_MONTH']==26)]
df11.head()

       DAY_OF_MONTH ORIGIN_STATE_NM DEST_STATE_NM
13131            25      California        Hawaii
13132            26      California        Hawaii
13162            25          Hawaii    California
13163            26          Hawaii    California
13193            25      California        Hawaii